# AnalyticalModelStickElementsMark Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelStickElementsMark Property
ParameterTypeId Class See Also
---
"Member Number": Used for beams, braces, columns
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelStickElementsMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelStickElementsMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelStickElementsMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace